Stichting-MINIX-Research-Foundation/minix/commands/httpd/http_status.5
.TH HTTP_STATUS 5
.SH 
http_status \- HTTP status numbers and their meanings
.SH DESCRIPTION
These are the HTTP status numbers defined in 
.BI http.h
in the source directory,
.BI /usr/local/src/httpdxxx.
The message you see on your screen when a page cannot be accessed is 
normally generated by your browser.
.P
HTTP_STATUS_OK                  200
.br
HTTP_STATUS_CREATED             201
.br
HTTP_STATUS_ACCEPTED            202
.br
HTTP_STATUS_NO_CONTENT          204
.br
HTTP_STATUS_MOVED_PERM          301
.br
HTTP_STATUS_MOVED_TEMP          302
.br
HTTP_STATUS_NOT_MODIFIED        304
.br
HTTP_STATUS_USE_PROXY           305
.br
HTTP_STATUS_BAD_REQUEST         400
.br
HTTP_STATUS_UNAUTHORIZED        401
.br
HTTP_STATUS_FORBIDDEN           403
.br
HTTP_STATUS_NOT_FOUND           404
.br
HTTP_STATUS_METHOD_NOT_ALLOWED  405
.br
HTTP_STATUS_PROXY_AUTH_REQRD    407
.br
HTTP_STATUS_LENGTH_REQUIRED     411
.br
HTTP_STATUS_SERVER_ERROR        500
.br
HTTP_STATUS_NOT_IMPLEMENTED     501
.br
HTTP_STATUS_BAD_GATEWAY         502
.br
HTTP_STATUS_SERVICE_UNAVAILABLE 503
.br
HTTP_STATUS_GATEWAY_TIMEOUT     504
.br
HTTP_STATUS_UNSUPPORTED_VERSION 505
.br

.SH FILES
.TP 25n
.B /usr/local/src/httpdxxx/http.h 
.SH "SEE ALSO"
The definitive source of information on the HTTP protocol is the
.B "World Wide Web Consortium"  
web page at 
.B http://www.w3c.org .
.P
A draft version of the HTTP 1.1 specification is available on the Minix1
websites. For more information on status codes go to this URL:
.B http://minix1.hampshire.edu/http11.html#Status-Codes
.SH AUTHOR
The Minix httpd server was created by and is maintained by Michael Temari 
<Michael@TemWare.Com>
.br
This man page was compiled by Al Woodhull <awoodhull@hampshire.edu>
.P
updated 2003-07-06
