Stichting-MINIX-Research-Foundation/minix/man/man8/backup.8
.TH BACKUP 8
.SH NAME
backup \- backup files
.SH SYNOPSIS
\fBbackup\fR [\fB\-djmnorstvz\fR] \fIdir1 dir2\fR
.br
.de FL
.TP
\\fB\\$1\\fR
\\$2
..
.de EX
.TP 20
\\fB\\$1\\fR
# \\$2
..
.SH OPTIONS
.TP 5
.B \-d
# At top level, only directories are backed up
.TP 5
.B \-j
# Do not copy junk: \fI *.Z, *.bak, a.out, core\fR, etc
.TP 5
.B \-m
# If device full, prompt for new diskette
.TP 5
.B \-n
# Do not backup top-level directories
.TP 5
.B \-o
# Do not copy \fI*.o\fR files
.TP 5
.B \-r
# Restore files
.TP 5
.B \-s
# Do not copy \fI*.s\fR files
.TP 5
.B \-t
# Preserve creation times
.TP 5
.B \-v
# Verbose; list files being backed up
.TP 5
.B \-z
# Compress the files on the backup medium
.SH EXAMPLES
.TP 20
.B backup \-mz . /f0
# Backup current directory compressed
.TP 20
.B backup /bin /usr/bin
# Backup bin from RAM disk to hard disk
.SH DESCRIPTION
.PP
\fIBackup\fR (recursively) backs up the contents of a given directory and its
subdirectories to another part of the file system.
It has two typical uses.
First, some portion of the file system can be backed up onto 1 or more
diskettes.
When a diskette fills up, the user is prompted for a new one.
The backups are in the form of mountable file systems.
Second, a directory on RAM disk can be backed up onto hard disk.
If the target directory is empty, the entire source directory is copied
there, optionally compressed to save space.
If the target directory is an old backup, only those files in the target
directory that are older than similar names in the source directory are
replaced.
\fIBackup\fR uses times for this purpose, like \fImake\fR.
Calling \fIBackup\fR as \fIRestore\fR is equivalent to using the -r option; 
this replaces newer files in the target directory with older files from the
source directory, uncompressing them if necessary.  The target directory
contents are thus returned to some previous state.
.SH "SEE ALSO"
.BR tar (1).
