Stichting-MINIX-Research-Foundation/minix/man/man8/partition.8
.TH PARTITION 8
.SH NAME
partition \- make a partition table
.SH SYNOPSIS
.B partition
.RB [ \-mfn ]
.I device
[\fItype\fP:]\fIlength\fP[\fB+*\fP] ...
.SH DESCRIPTION
.B Partition
makes a partition table on
.I device
using the types and sizes given.  It may be used in combination with
.BR repartition (8)
for automatic installation of MINIX 3.  
.PP
You may give up to four \fItype\fP:\fIlength\fP[\fB+*\fP] specifications
for the partitions.  You may also specify holes before, between, and after
the partitions.  A hole differs from a partition specification by not having
a type.
.PP
The first hole is by default 1 sector to make space for the primary
bootstrap and the partition table.  The other holes are 0.
.PP
The
.I type
field is the type of the partitition in hexadecimal.  The
.I length
field is the partition's size in sectors.  The
.B +
or
.B *
may optionally be added to indicate that the partition must be expanded
to contain any leftover space on the device or to mark the partition active.
.PP
Instead of a length you may use the word
.B exist
to indicate that an existing partition of the given type must be kept
from the old partition table.
.PP
Partitions are padded out to cylinder boundaries, except for the first one,
it starts on track 1.  Some operating systems care about this.  MINIX 3 and
MS-DOS do not.
.SH OPTIONS
.TP
.B \-m
MINIX 3 only, no need to pad partitions.  This is the default for subpartition
tables.
.TP
.B \-f
Force making a partition table even if the device is too small.
.TP
.B \-n
Play-act, don't write the new table, just show what it would look like.
.SH EXAMPLE
.B "partition /dev/hd0 01:16384 81:40000 81:2880* 06:20000+"
.PP
Partitions disk 0 into an 8 Mb DOS partition, 20 Mb MINIX 3 /usr, 1.44 Mb MINIX 3
/ (active), and a DOS partition of at least 10 Mb at the end of the disk.
(06:0+ would have been ok too, it's just a sanity check.)
.SH "SEE ALSO"
.BR hd (4),
.BR part (8),
.BR repartition (8).
.SH AUTHOR
Kees J. Bot (kjb@cs.vu.nl)
