Stichting-MINIX-Research-Foundation/minix/usr.sbin/link/link.8
.\"	$NetBSD: link.8,v 1.6 2008/04/30 13:11:02 martin Exp $
.\"
.\" Copyright (c) 1999 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Klaus Klein.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd July 18, 1999
.Dt LINK 8
.Os
.Sh NAME
.Nm link
.Nd call the
.Fn link
function
.Sh SYNOPSIS
.Nm
.Ar file1
.Ar file2
.Sh DESCRIPTION
The
.Nm
utility performs the function call
.Fn link file1 file2 .
.Pp
.Ar file1
must be the pathname of an existing file, and
.Ar file2
is the pathname of the new link to
.Ar file1
to be created.
.Sh EXIT STATUS
The
.Nm
utility
exits 0 on success, and \*[Gt]0 if an error occurs.
.Sh SEE ALSO
.Xr ln 1 ,
.Xr link 2 ,
.Xr unlink 8
.Sh STANDARDS
The
.Nm
utility conforms to
.St -xcu5 .
