Stichting-MINIX-Research-Foundation/minix/minix/commands/lp/lp.1
.TH LP 1
.SH NAME
lp, lpd \- copy a file to the line printer
.SH SYNOPSIS
.B lp
.RI [ file " ...]"
.SH DESCRIPTION
Each file argument to
.B lp
is send to the line printer to be printed.  Standard input is read and
printed if there are no arguments.
.B Lp
executes
.B /usr/lib/lpd
with each file as input.
.B Lpd
puts the file in
.B /usr/spool/lpd
and starts printing the jobs on
.B /dev/lp
unless another
.B lpd
is already running.  If
.B lpd
finds any character in the input that it doesn't know how to handle then it
will print the rest of the file without any special treatment.  This also
means that no formfeed is sent after the file has been printed to force out
the page.
.B Lpd
simply assumes that you know what you are doing.  (dumb, eh?)
.PP
Note: Don't do anything with a file until it is printed,
.B lpd
only makes a copy of a file in the spool directory when it is not world
readable.  If it can be read then it is printed directly.
.SH FILES
.TP 20
.BI /usr/spool/lpd/job XXXXX
Information about a job.
.TP
.BI /usr/spool/lpd/tmp XXXXX
Associated file to be printed.
.TP
.B /etc/termcap
The 'lp' entry describes the printer by the "li#" and "co#" fields.  By
default 66 lines (li#66), and 80 columns (co#80).
.SH "SEE ALSO"
.BR lp (4),
.BR termcap (5),
.BR termcap (7).
.SH BUGS
Not spooling a world readable file may not be such a smart idea.
.PP
A formfeed should be printed and the printer reset after a job full of escape
codes, but this may cost paper.
.PP
No banner page.
.SH AUTHOR
Kees J. Bot (kjb@cs.vu.nl)
